Revit 2027 API
BuiltInFailures.SketchFailures.StairClosedBoundaries Property
 Stairs Boundaries (chains of one or more Boundary Lines) should not form closed loops.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StairClosedBoundaries { get; }
Public Shared ReadOnly Property StairClosedBoundaries As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StairClosedBoundaries {
	FailureDefinitionId^ get ();
}
static member StairClosedBoundaries : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace